x_1 = 1.5
x = [0, 1, 2, 3, 4]
f = [1, 0.86603, 0.5, 0, -0.5]
sis1 = 3*(f[2] - 2*f[1] +f[0])
sis2 = 3*(f[3] - 2*f[2] +f[1])
sis3 = 3*(f[4] - 2*f[3] +f[2])
print(str(sis1))
print(str(sis2))
print(str(sis3))
#Решим систему  4c2+c3 = sis1
#               c2+4c3+c4 = sis2
#               c3+4c4 = sis3
c = [0, -0.1578, -0.0651, 0.0163]
a = [f[0], f[1], f[2], f[3]]
b = [-0.0814, -0.2391, -0.462, -0.5109]
d = [0.0526, 0.0309, 0.0271, -0.0054]
# 1.5 принадлжит второму отрезку (от 1 до 2) тогда составим кубический сплайн
print ('Кубический сплайн: ' + str(a[1]) + ' - 0.2391(x-1) - 0.1578(x-1)^2 + 0.0309(x-1)^3')
#подставим наше значение x
zn =  0.86603 - 0.2391*(1.5 - 1) - 0.1578*(1.5 - 1)**2 + 0.0309*(1.5 - 1)**3
print ('f(1.5) = ' + str(zn))