#include <iostream>
using namespace std;
int main()
{
    setlocale(LC_ALL, "Russian");
    double x[6]{-1, 0, 1, 2, 3, 4}, y[6]{0.86603, 1, 0.86603, 0.5, 0, -0.5}, a_0, a_1, a_2, osh1 = 0, F[6], F2[6], osh2 = 0;
    //Решим систему нормальную систему МНК {6a0 + 9a1 = 2.73206; 9a0 + 31a1 = -1}
    a_0 = 0.8923;
    a_1 = -0.2913;
    cout << "Многочлен первой степени: F1(x) = 0.8923 - 0.2913x" << endl;
    for (int i = 0; i < 6; i++)
    {
        F[i] = a_0 + a_1 * x[i];
        osh1 += pow(F[i] - y[i], 2);
    }
    cout << "Сумма квадратов ошибок для первой степени: " << osh1 << endl;
    //Решим систему для второй степени {6a0 + 9a1 + 31a2= 2.73206; 9a0 + 31a1 + 99a2 = -1; 31a0 + 99a1 + 355a2 = -4.26794}
    a_0 = 0.9475;
    a_1 = -0.043;
    a_2 = -0.087;
    cout << "Многочлен второй степени: F2(x) = 0.9475 - 0.043x - 0.087x^2 " << endl;
    for (int i = 0; i < 6; i++)
    {
        F2[i] = a_0 + a_1*x[i] + a_2*pow(x[i], 2);
        osh2 += pow(F2[i] - y[i], 2);
    }
    cout << "Сумма квадратов ошибок для второй степени: " << osh2 << endl;
 }
